John-Varghese-EH/ESP32CAM-ONVIF/ESP32CAM-ONVIF/web_config.cpp
#include "web_config.h"
#include <WebServer.h>
#include <WiFi.h>
#include "index_html.h" // Inline HTML
#include "rtsp_server.h"
#include "onvif_server.h"
#include "motion_detection.h"
#include "auto_flash.h"
#include "camera_control.h"
#include <FS.h>
#include <SPIFFS.h>
#include <SD_MMC.h>
#include <ArduinoJson.h>
#include "esp_camera.h"
#include "wifi_manager.h"
#include "config.h"
#include <Update.h>
#include <esp_task_wdt.h>
#include "sd_recorder.h"
#ifdef BLUETOOTH_ENABLED
  #include "bluetooth_manager.h"
  #include "audio_manager.h"
#endif

// PTZ Servo support (if enabled)
#if PTZ_ENABLED
  #include <ESP32Servo.h>
  extern Servo servoPan;
  extern Servo servoTilt;
#endif

WebServer webConfigServer(WEB_PORT);

// WEB_USER and WEB_PASS are defined in config.h


bool isAuthenticated(WebServer &server) {
    if (!server.authenticate(WEB_USER, WEB_PASS)) {
        server.requestAuthentication();
        return false;
    }
    return true;
}

void web_config_start() {
    // SPIFFS no longer required for index.html, but still needed for SD/Config persistence if used
    if (!SPIFFS.begin(true)) {
        Serial.println("[WARN] SPIFFS Mount Failed - Configs might not save");
    }

    // Serving Embedded HTML
    webConfigServer.on("/", HTTP_GET, []() {
        if (!webConfigServer.authenticate(WEB_USER, WEB_PASS)) {
           return webConfigServer.requestAuthentication();
        }
        webConfigServer.send_P(200, "text/html", index_html);
    });

    // --- API ENDPOINTS ---
    webConfigServer.on("/api/status", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        String json = "{";
        json += "\"status\":\"Online\",";
        json += "\"rtsp\":\"" + getRTSPUrl() + "\",";
        json += "\"onvif\":\"http://" + WiFi.localIP().toString() + ":" + String(ONVIF_PORT) + "/onvif/device_service\",";
        json += "\"onvif_enabled\":" + String(onvif_is_enabled() ? "true" : "false") + ",";
        json += "\"motion\":" + String(motion_detected() ? "true" : "false") + ",";
        json += "\"recording\":" + String(sd_recorder_is_recording() ? "true" : "false") + ",";
        json += "\"sd_mounted\":" + String(sd_recorder_is_mounted() ? "true" : "false") + ",";
        json += "\"heap\":" + String(ESP.getFreeHeap()) + ",";
        json += "\"uptime\":" + String(millis() / 1000) + ",";
        json += "\"rssi\":" + String(WiFi.RSSI()) + ",";
        json += "\"autoflash\":" + String(auto_flash_is_enabled() ? "true" : "false");
        json += "}";
        webConfigServer.send(200, "application/json", json);
    });

    // --- Change Camera Settings ---
    webConfigServer.on("/api/config", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        StaticJsonDocument<256> doc;
        DeserializationError err = deserializeJson(doc, webConfigServer.arg("plain"));
        if (err) {
            webConfigServer.send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
            return;
        }
        sensor_t * s = esp_camera_sensor_get();
        if (doc.containsKey("xclk")) {
            // To change xclk, you must re-init the camera. Not recommended at runtime.
            // Save to config and apply on reboot if needed.
        }
        if (doc.containsKey("resolution")) {
            String res = doc["resolution"].as<String>();
            if (res == "UXGA")      s->set_framesize(s, FRAMESIZE_UXGA);
            else if (res == "SXGA") s->set_framesize(s, FRAMESIZE_SXGA);
            else if (res == "XGA")  s->set_framesize(s, FRAMESIZE_XGA);
            else if (res == "SVGA") s->set_framesize(s, FRAMESIZE_SVGA);
            else if (res == "VGA")  s->set_framesize(s, FRAMESIZE_VGA);
            else if (res == "CIF")  s->set_framesize(s, FRAMESIZE_CIF);
            else if (res == "QVGA") s->set_framesize(s, FRAMESIZE_QVGA);
            else if (res == "QQVGA")s->set_framesize(s, FRAMESIZE_QQVGA);
        }
        if (doc.containsKey("quality"))     s->set_quality(s, doc["quality"]);
        if (doc.containsKey("brightness"))  s->set_brightness(s, doc["brightness"]);
        if (doc.containsKey("contrast"))    s->set_contrast(s, doc["contrast"]);
        if (doc.containsKey("saturation"))  s->set_saturation(s, doc["saturation"]);
        if (doc.containsKey("awb"))         s->set_whitebal(s, doc["awb"]);
        if (doc.containsKey("awb_gain"))    s->set_awb_gain(s, doc["awb_gain"]);
        if (doc.containsKey("wb_mode"))     s->set_wb_mode(s, doc["wb_mode"]);
        if (doc.containsKey("aec"))         s->set_aec2(s, doc["aec"]);
        if (doc.containsKey("aec2"))        s->set_aec2(s, doc["aec2"]);
        if (doc.containsKey("ae_level"))    s->set_ae_level(s, doc["ae_level"]);
        if (doc.containsKey("agc"))         s->set_gain_ctrl(s, doc["agc"]);
        if (doc.containsKey("gainceiling")) s->set_gainceiling(s, doc["gainceiling"]);
        if (doc.containsKey("bpc"))         s->set_bpc(s, doc["bpc"]);
        if (doc.containsKey("wpc"))         s->set_wpc(s, doc["wpc"]);
        if (doc.containsKey("raw_gma"))     s->set_raw_gma(s, doc["raw_gma"]);
        if (doc.containsKey("lenc"))        s->set_lenc(s, doc["lenc"]);
        if (doc.containsKey("hmirror"))     s->set_hmirror(s, doc["hmirror"]);
        if (doc.containsKey("vflip"))       s->set_vflip(s, doc["vflip"]);
        if (doc.containsKey("dcw"))         s->set_dcw(s, doc["dcw"]);
        webConfigServer.send(200, "application/json", "{\"ok\":1}");
    });

    // --- SD Card File List ---
    webConfigServer.on("/api/sd/list", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        String json = "[";
        File root = SD_MMC.open("/");
        File file = root.openNextFile();
        bool first = true;
        while(file){
            if (!first) json += ",";
            json += "\"" + String(file.name()) + "\"";
            file = root.openNextFile();
            first = false;
        }
        json += "]";
        webConfigServer.send(200, "application/json", json);
    });

