John-Varghese-EH/ESP32CAM-ONVIF/ESP32CAM-ONVIF/web_config.cpp
        // Apply other settings
        if (doc.containsKey("autoflash")) {
            auto_flash_set_enabled(doc["autoflash"]);
        }
        if (doc.containsKey("onvif")) {
            onvif_set_enabled(doc["onvif"]);
        }
        
        #ifdef BLUETOOTH_ENABLED
        if (doc.containsKey("bluetooth")) {
            JsonObject bt = doc["bluetooth"];
            if (bt.containsKey("enabled")) appSettings.btEnabled = bt["enabled"];
            if (bt.containsKey("stealth")) appSettings.btStealthMode = bt["stealth"];
            if (bt.containsKey("mac")) appSettings.btPresenceMac = bt["mac"].as<String>();
            if (bt.containsKey("timeout")) appSettings.btPresenceTimeout = bt["timeout"];
            if (bt.containsKey("gain")) appSettings.btMicGain = bt["gain"];
            if (bt.containsKey("audioSource")) appSettings.audioSource = (AudioSource)bt["audioSource"].as<int>();
            saveSettings();
        }
        #endif
        
        webConfigServer.send(200, "application/json", "{\"ok\":1}");
    });

    // ==================== CAMERA PROFILES ====================
    // --- List Profiles ---
    webConfigServer.on("/api/profiles", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        String json = "{\"profiles\":[\"Default\",\"Daytime\",\"Night\",\"Indoor\",\"Outdoor\"]}";
        webConfigServer.send(200, "application/json", json);
    });
    
    // --- Save Profile ---
    webConfigServer.on("/api/profiles/save", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        StaticJsonDocument<512> doc;
        deserializeJson(doc, webConfigServer.arg("plain"));
        String profileName = doc["name"];
        
        sensor_t * s = esp_camera_sensor_get();
        
        // Build profile JSON
        String profileJson = "{";
        profileJson += "\"framesize\":" + String(s->status.framesize) + ",";
        profileJson += "\"quality\":" + String(s->status.quality) + ",";
        profileJson += "\"brightness\":" + String(s->status.brightness) + ",";
        profileJson += "\"contrast\":" + String(s->status.contrast) + ",";
        profileJson += "\"saturation\":" + String(s->status.saturation) + ",";
        profileJson += "\"ae_level\":" + String(s->status.ae_level) + ",";
        profileJson += "\"gainceiling\":" + String(s->status.gainceiling) + ",";
        profileJson += "\"awb\":" + String(s->status.awb) + ",";
        profileJson += "\"aec\":" + String(s->status.aec2) + ",";
        profileJson += "\"agc\":" + String(s->status.agc) + ",";
        profileJson += "\"hmirror\":" + String(s->status.hmirror) + ",";
        profileJson += "\"vflip\":" + String(s->status.vflip);
        profileJson += "}";
        
        // Save to SPIFFS
        File file = SPIFFS.open("/profiles/" + profileName + ".json", "w");
        if (file) {
            file.print(profileJson);
            file.close();
            webConfigServer.send(200, "application/json", "{\"ok\":1}");
        } else {
            webConfigServer.send(500, "application/json", "{\"error\":\"Failed to save\"}");
        }
    });
    
    // --- Load Profile ---
    webConfigServer.on("/api/profiles/load", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        StaticJsonDocument<128> doc;
        deserializeJson(doc, webConfigServer.arg("plain"));
        String profileName = doc["name"];
        
        // Load from SPIFFS
        File file = SPIFFS.open("/profiles/" + profileName + ".json", "r");
        if (!file) {
            webConfigServer.send(404, "application/json", "{\"error\":\"Profile not found\"}");
            return;
        }
        
        String profileJson = file.readString();
        file.close();
        
        StaticJsonDocument<512> profile;
        deserializeJson(profile, profileJson);
        
        sensor_t * s = esp_camera_sensor_get();
        
        // Apply profile
        if (profile.containsKey("framesize")) s->set_framesize(s, (framesize_t)profile["framesize"].as<int>());
        if (profile.containsKey("quality")) s->set_quality(s, profile["quality"]);
        if (profile.containsKey("brightness")) s->set_brightness(s, profile["brightness"]);
        if (profile.containsKey("contrast")) s->set_contrast(s, profile["contrast"]);
        if (profile.containsKey("saturation")) s->set_saturation(s, profile["saturation"]);
        if (profile.containsKey("ae_level")) s->set_ae_level(s, profile["ae_level"]);
        if (profile.containsKey("gainceiling")) s->set_gainceiling(s, (gainceiling_t)profile["gainceiling"].as<int>());
        if (profile.containsKey("awb")) s->set_whitebal(s, profile["awb"]);
        if (profile.containsKey("aec")) s->set_aec2(s, profile["aec"]);
        if (profile.containsKey("agc")) s->set_gain_ctrl(s, profile["agc"]);
        if (profile.containsKey("hmirror")) s->set_hmirror(s, profile["hmirror"]);
        if (profile.containsKey("vflip")) s->set_vflip(s, profile["vflip"]);
        
        webConfigServer.send(200, "application/json", "{\"ok\":1,\"profile\":" + profileJson + "}");
    });
    
    // --- Delete Profile ---
    webConfigServer.on("/api/profiles/delete", HTTP_DELETE, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        StaticJsonDocument<128> doc;
        deserializeJson(doc, webConfigServer.arg("plain"));
        String profileName = doc["name"];
        
        if (SPIFFS.remove("/profiles/" + profileName + ".json")) {
            webConfigServer.send(200, "application/json", "{\"ok\":1}");
        } else {
            webConfigServer.send(404, "application/json", "{\"error\":\"Profile not found\"}");
        }
    });

    // ==================== EVENT LOG ====================
    #define MAX_EVENTS 100
    struct LogEvent {
        unsigned long timestamp;
        String type;
        String message;
    };
    static LogEvent eventLog[MAX_EVENTS];
    static int eventCount = 0;
    static int eventIndex = 0;
    
    // Helper to add event
    auto addEvent = [](String type, String message) {
        eventLog[eventIndex].timestamp = millis();
        eventLog[eventIndex].type = type;
        eventLog[eventIndex].message = message;
        eventIndex = (eventIndex + 1) % MAX_EVENTS;
        if (eventCount < MAX_EVENTS) eventCount++;
    };
    
    // --- Get Events ---
    webConfigServer.on("/api/events", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        String json = "{\"events\":[";
        
        int start = (eventIndex - eventCount + MAX_EVENTS) % MAX_EVENTS;
        for (int i = 0; i < eventCount; i++) {
            int idx = (start + i) % MAX_EVENTS;
            if (i > 0) json += ",";
            json += "{";
            json += "\"timestamp\":" + String(eventLog[idx].timestamp) + ",";
            json += "\"type\":\"" + eventLog[idx].type + "\",";
            json += "\"message\":\"" + eventLog[idx].message + "\"";
            json += "}";
        }
        
