John-Varghese-EH/ESP32CAM-ONVIF/ESP32CAM-ONVIF/web_config.cpp
        json += "]}";
        webConfigServer.send(200, "application/json", json);
    });
    
    // --- Clear Events ---
    webConfigServer.on("/api/events", HTTP_DELETE, []() {
        if (!isAuthenticated(webConfigServer)) return;
        eventCount = 0;
        eventIndex = 0;
        webConfigServer.send(200, "application/json", "{\"ok\":1}");
    });
    
    // Log system boot event
    addEvent("boot", "System started");

    // ==================== VIDEO RECORDINGS ====================
    // --- List Recordings ---
    webConfigServer.on("/api/recordings", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        String json = "{\"recordings\":[";
        File root = SD_MMC.open("/");
        File file = root.openNextFile();
        bool first = true;
        
        while(file) {
            if (!file.isDirectory()) {
                String fname = String(file.name());
                if (fname.endsWith(".avi") || fname.endsWith(".mp4") || fname.endsWith(".mjpeg")) {
                    if (!first) json += ",";
                    json += "{";
                    json += "\"name\":\"" + fname + "\",";
                    json += "\"size\":" + String(file.size()) + ",";
                    json += "\"time\":" + String(file.getLastWrite());
                    json += "}";
                    first = false;
                }
            }
            file = root.openNextFile();
        }
        
        json += "]}";
        webConfigServer.send(200, "application/json", json);
    });
    
    // --- Stream Recording ---
    webConfigServer.on("/api/recordings/stream", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        if (!webConfigServer.hasArg("file")) {
            webConfigServer.send(400, "text/plain", "Missing file param");
            return;
        }
        
        String filename = "/" + webConfigServer.arg("file");
        File file = SD_MMC.open(filename, "r");
        
        if (!file) {
            webConfigServer.send(404, "text/plain", "File not found");
            return;
        }
        
        String contentType = "video/mpeg";
        if (filename.endsWith(".mp4")) contentType = "video/mp4";
        else if (filename.endsWith(".mjpeg")) contentType = "video/x-motion-jpeg";
        
        webConfigServer.streamFile(file, contentType);
        file.close();
    });
    
    // --- Delete Recording ---
    webConfigServer.on("/api/recordings/delete", HTTP_DELETE, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        StaticJsonDocument<128> doc;
        deserializeJson(doc, webConfigServer.arg("plain"));
        String filename = "/" + doc["file"].as<String>();
        
        if (SD_MMC.remove(filename)) {
            webConfigServer.send(200, "application/json", "{\"ok\":1}");
        } else {
            webConfigServer.send(404, "application/json", "{\"error\":\"Delete failed\"}");
        }
    });

    // ==================== NETWORK DIAGNOSTICS ====================
    // --- Ping Test ---
    webConfigServer.on("/api/network/ping", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        unsigned long timestamp = millis();
        String json = "{";
        json += "\"timestamp\":" + String(timestamp) + ",";
        json += "\"rssi\":" + String(WiFi.RSSI()) + ",";
        json += "\"ip\":\"" + WiFi.localIP().toString() + "\"";
        json += "}";
        
        webConfigServer.send(200, "application/json", json);
    });
    
    // --- Bandwidth Test ---
    webConfigServer.on("/api/network/bandwidth-test", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        size_t dataSize = webConfigServer.arg("plain").length();
        unsigned long timestamp = millis();
        
        String json = "{";
        json += "\"bytes_received\":" + String(dataSize) + ",";
        json += "\"timestamp\":" + String(timestamp);
        json += "}";
        
        webConfigServer.send(200, "application/json", json);
    });

    // --- Time Sync API ---
    webConfigServer.on("/api/time", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        StaticJsonDocument<64> doc;
        deserializeJson(doc, webConfigServer.arg("plain"));
        long epoch = doc["epoch"];
        if(epoch > 0) {
            struct timeval tv;
            tv.tv_sec = epoch;
            tv.tv_usec = 0;
            settimeofday(&tv, NULL); 
            Serial.println("[INFO] Time set via Web");
            webConfigServer.send(200, "application/json", "{\"ok\":1}");
        } else {
             webConfigServer.send(400, "application/json", "{\"error\":\"Invalid time\"}");
        }
    });

    // --- OTA Firmware Update ---
    webConfigServer.on("/api/update", HTTP_POST, []() {
        webConfigServer.send(200, "application/json", (Update.hasError()) ? "{\"success\":false}" : "{\"success\":true}");
        delay(1000);
        ESP.restart();
    }, []() {
        HTTPUpload& upload = webConfigServer.upload();
        if (upload.status == UPLOAD_FILE_START) {
            Serial.printf("[INFO] Update: %s\n", upload.filename.c_str());
            if (!Update.begin(UPDATE_SIZE_UNKNOWN)) { 
                Update.printError(Serial);
            }
        } else if (upload.status == UPLOAD_FILE_WRITE) {
            if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
                Update.printError(Serial);
            }
        } else if (upload.status == UPLOAD_FILE_END) {
            if (Update.end(true)) { 
                Serial.printf("[INFO] Update Success: %u\n", upload.totalSize);
            } else {
                Update.printError(Serial);
            }
        }
    });
    
    // --- WiFi API Endpoints ---
    webConfigServer.on("/api/wifi/status", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        String json = "{";
        json += "\"connected\":" + String(WiFi.status() == WL_CONNECTED ? "true" : "false") + ",";
        json += "\"ssid\":\"" + wifiManager.getSSID() + "\",";
        json += "\"ip\":\"" + wifiManager.getLocalIP().toString() + "\",";
        json += "\"mode\":\"" + String(wifiManager.isInAPMode() ? "AP" : "STA") + "\"";
        json += "}";
        
